import Tree.IntTree;

public class Main {
    public static void main(String[] args) {
        TaskList taskList = new TaskList();

        /* Задание 6.1
        Приведите пример использования древовидной структуры.*/
        taskList.task1();

        /* Задание 6.2
        Реализуйте класс узла дерева и базовый шаблон дерева с базовыми методами.*/
        IntTree intTree = taskList.task2();

        /*Задание 6.3
        Реализуйте методы поиска и вставки узла в дерево.*/
        taskList.task3(intTree);

        /*Задание 6.4
        Реализуйте базовые методы обхода дерева и метода дисплей.
        Реализуйте поиск максимума и минимума.*/
        taskList.task4(intTree);

        /*Задание 6.5
        Реализуйте метод удаления узла и выполните оценку времени базовых методов дерева с помощью System.nanoTime().*/
        taskList.task5(intTree);

        /*Задание 6.6
        Реализуйте на основе массива из задания 2.1 алгоритм пирамидальной сортировки с реализацией бинарной пирамиды.
        Выполните оценку алгоритма пирамидальной сортировки с помощью System.nanoTime() и сравните с предыдущими алгоритмами сортировки.*/
        ExampleClass[] arr = Utills.createAndFillExampleClassArr(400);
        taskList.task6(arr);

        /*Задание 6.7
        Приведите пример сбалансированного дерева и его применения.*/
        taskList.task7(arr);

    }
}
